src/Catalogs/Карты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Карты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнутреннийКодКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаБлокировки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заблокирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартаУдалена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКартыОктаграм</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоУстановок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользоватьБиометрию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаУстановкуКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МедицинскиеКарты</v8:Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.Карты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПартииНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ВидыКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыКарт</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Штриховая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Магнитная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Wallet</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыВнешнихСистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыВнешнихСистем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Calltouch</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Chat2Desk</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CoMagic</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GreenApi</Name>
					<Comment>WhatsApp</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IPТелефония</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>JivoSite</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Marquiz</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Roistat</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TapLink</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Telegram</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Tilda</Name>
					<Comment>Ловец лидов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Viber</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Vkontakte</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VkontakteApi</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Wallet</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Webhook</Name>
					<Comment>Получение лидов стандартный набор параметров</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВиджетОнлайнЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИЭМК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтурСтрахование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МобильноеПриложениеУправляющего</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОценкиИОтзывы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроДокторов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексМетрика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СистемаБыстрыхПлатежей</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ВидыКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВидыКарт</Name>
			<Comment>Виды карт</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Именная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПроекта</Name>
					<Comment>Используется для карт с типом Wallet</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонСообщения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяЖизниКартыВМесяцах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ВнешниеСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВнешниеСистемы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторизацияПоКодуБезСМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Comment>Внешняя система используется</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючШифрования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючШифрованияОбратногоЗвонка</Name>
					<Comment>Используется для обратного звонка в CRM</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Синхронизирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВнешнейСистемы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВнешнихСистем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТокенДоступа</Name>
					<Comment>Используется для отправки Push уведомлений</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УправлениеВЛичномКабинете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Карты/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

// Функция проверяет на возможность добавдения записи в регистр
// 
Функция ПроверитьНаличиеШтрихКода(ТекСсылка, КодКарты) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1 РАЗРЕШЕННЫЕ
	|	Штрихкоды.Штрихкод,
	|	Штрихкоды.Объект,
	|	Штрихкоды.Упаковка,
	|	Штрихкоды.Объект.Наименование КАК ОбъектПредставление,
	|	Штрихкоды.Упаковка.Наименование КАК УпаковкаПредставление
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Штрихкод = &Штрихкод
	|	И Штрихкоды.Объект <> &ТекСсылка";
	
	Запрос.УстановитьПараметр("Штрихкод" , КодКарты);
	Запрос.УстановитьПараметр("ТекСсылка", ТекСсылка); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ОписаниеОшибки = НСтр("ru='Такой штрихкод уже назначен для объекта %Объект%'");
		ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%Объект%", """" + Выборка.ОбъектПредставление + """"
		                            + ?(ЗначениеЗаполнено(Выборка.Упаковка), " """ + НСтр("ru='в упаковке'") + " " + Выборка.УпаковкаПредставление + """", ""));
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки;
		Сообщение.Поле = "Запись.Штрихкод";
		Сообщение.Сообщить();
		Возврат Истина;
	Иначе Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Функция возвращает данные штрихкода по владельцу карты
// 
Функция ПолучитьДанныеШтрихкода(КартаКлиента) Экспорт 
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	Штрихкоды.Штрихкод
	                      |ИЗ
	                      |	РегистрСведений.Штрихкоды КАК Штрихкоды
	                      |ГДЕ
	                      |	Штрихкоды.Объект = &КартаКлиента");
	Запрос.УстановитьПараметр("КартаКлиента", КартаКлиента);
	Выборка = ЗАпрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Штрихкод;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция возвращает данные владельца магнитной карты
// 
Функция ПолучитьДанныеМагнитнойКарты(КодКарты) Экспорт 
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Карты.Ссылка КАК Карта
	|ИЗ
	|	Справочник.Карты КАК Карты
	|ГДЕ
	|	Карты.КодКарты = &КодКарты
	|	И НЕ Карты.ПометкаУдаления");
	
	Запрос.УстановитьПараметр("КодКарты", КодКарты);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Карта;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция возвращает данные владельца магнитной карты или ключа
// 
Функция ПолучитьДанныеМагнитнойКартыКлюча(КодКарты) Экспорт 
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Карты.Ссылка КАК Карта,
	|	Карты.ВладелецКарты КАК ВладелецКарты,
	|	Карты.ПометкаУдаления КАК ПометкаУдаления,
	|	Карты.Заблокирована КАК Заблокирована
	|ИЗ
	|	Справочник.Карты КАК Карты
	|ГДЕ
	|	Карты.КодКарты = &КодКарты
	|	И НЕ Карты.ПометкаУдаления");
	
	Запрос.УстановитьПараметр("КодКарты", КодКарты);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Новый Структура("Карта, ВладелецКарты, ПометкаУдаления, Заблокирована", 
				Выборка.Карта, Выборка.ВладелецКарты, Выборка.ПометкаУдаления, Выборка.Заблокирована);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Фукция проверяет на возможность добавления элемента справочника
// 
Функция ПроверитьНаличиеМагнитногоКода(ТекСсылка, КодКарты) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1 РАЗРЕШЕННЫЕ
	|	Карты.КодКарты,
	|	Карты.ВладелецКарты КАК Объект
	|ИЗ
	|	Справочник.Карты КАК Карты
	|ГДЕ
	|	Карты.КодКарты = &КодКарты
	|	И Карты.Ссылка <> &КартаКлиента";
	
	Запрос.УстановитьПараметр("КодКарты"    , КодКарты);
	Запрос.УстановитьПараметр("КартаКлиента", ТекСсылка); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ОписаниеОшибки = НСтр("ru='Такой код карты уже назначен для клиента %Объект%'");
		ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%Объект%", """" + Выборка.Объект + """");		                           
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки;	
		Сообщение.Сообщить();
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	
	
КонецФункции

// Функция - Проверить наличие кода
//
// Параметры:
//  ТекущаяСсылкаНаКарту - 	 - 
//  КодКарты			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПроверитьНаличиеКодаВСистеме(ТекущаяСсылкаНаКарту, ТипКода, КодКарты, ВнутрКодКарты) Экспорт
		
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("ЕстьКодВБазе", Ложь);
	СтруктураРезультата.Вставить("КартаКлиента"			, Неопределено);
	СтруктураРезультата.Вставить("ПредставлениеКарты"	, Неопределено);
	СтруктураРезультата.Вставить("Клиент"				, Неопределено);
	СтруктураРезультата.Вставить("ПредставлениеКлиента"	, Неопределено);
	СтруктураРезультата.Вставить("КодКарты"				, Неопределено);
	СтруктураРезультата.Вставить("Заблокирована"		, Неопределено);
	СтруктураРезультата.Вставить("ПометкаУдаления"		, Неопределено);
	
	ЕстьКодВБазе = Ложь;
	
	Если СокрЛП(КодКарты) <> "" Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Карты.Ссылка КАК Карта
		|ИЗ
		|	Справочник.Карты КАК Карты
		|ГДЕ
		|	Карты.Ссылка <> &КартаКлиента
		|	И Карты.КодКарты = &КодКарты";
		
		Запрос.УстановитьПараметр("КодКарты" 	, СокрЛП(КодКарты));
		Запрос.УстановитьПараметр("КартаКлиента", ТекущаяСсылкаНаКарту); 
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ЕстьКодВБазе = Истина;
			СтруктураРезультата.Вставить("ЕстьКодВБазе"			, Истина);
			СтруктураРезультата.Вставить("КартаКлиента"			, Выборка.Карта);
			СтруктураРезультата.Вставить("ПредставлениеКарты"	, Строка(Выборка.Карта));
			СтруктураРезультата.Вставить("Клиент"				, Выборка.Карта.ВладелецКарты);
			СтруктураРезультата.Вставить("ПредставлениеКлиента"	, СокрЛП(Строка(Выборка.Карта.ВладелецКарты)));
			СтруктураРезультата.Вставить("КодКарты"				, СокрЛП(Выборка.Карта.КодКарты));
			СтруктураРезультата.Вставить("Заблокирована"		, Выборка.Карта.Заблокирована);
			СтруктураРезультата.Вставить("ПометкаУдаления"		, Выборка.Карта.ПометкаУдаления);
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЕстьКодВБазе И СокрЛП(ВнутрКодКарты) <> "" Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Карты.Ссылка КАК Карта
		|ИЗ
		|	Справочник.Карты КАК Карты
		|ГДЕ
		|	Карты.Ссылка <> &КартаКлиента
		|	И Карты.ВнутреннийКодКарты = &КодКарты";
		
		Запрос.УстановитьПараметр("КодКарты" 	, СокрЛП(ВнутрКодКарты));
		Запрос.УстановитьПараметр("КартаКлиента", ТекущаяСсылкаНаКарту); 
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ЕстьКодВБазе = Истина;
			СтруктураРезультата.Вставить("ЕстьКодВБазе"			, Истина);
			СтруктураРезультата.Вставить("КартаКлиента"			, Выборка.Карта);
			СтруктураРезультата.Вставить("ПредставлениеКарты"	, Строка(Выборка.Карта));
			СтруктураРезультата.Вставить("Клиент"				, Выборка.Карта.ВладелецКарты);
			СтруктураРезультата.Вставить("ПредставлениеКлиента"	, СокрЛП(Строка(Выборка.Карта.ВладелецКарты)));
			СтруктураРезультата.Вставить("КодКарты"				, СокрЛП(Выборка.Карта.ВнутреннийКодКарты));
			СтруктураРезультата.Вставить("Заблокирована"		, Выборка.Карта.Заблокирована);
			СтруктураРезультата.Вставить("ПометкаУдаления"		, Выборка.Карта.ПометкаУдаления);
		КонецЕсли;
	
	КонецЕсли;	
	
	Возврат СтруктураРезультата;
	
КонецФункции

// Получить все карты клиента, можно укзать тип карты
// 
Функция ПолучитьКартыКлиента(
	Клиент, 
	ВидКарты = Неопределено, 
	ТипКода = Неопределено, 
	КоличествоЗаписей = Неопределено, 
	Заблокирована = Неопределено, 
	ИсключитьКарту = Неопределено, 
	ПометкаУдаления = Неопределено) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ &Количество
	|	Карты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Карты КАК Карты
	|ГДЕ
	|	Карты.ВладелецКарты = &ВладелецКарты
	|	И ВЫБОР
	|			КОГДА &ВидКарты <> НЕОПРЕДЕЛЕНО
	|				ТОГДА Карты.ВидКарты = &ВидКарты
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И (&ТипКода = НЕОПРЕДЕЛЕНО
	|			ИЛИ Карты.ТипКода = &ТипКода)
	|	И (&Заблокирована = НЕОПРЕДЕЛЕНО
	|			ИЛИ Карты.Заблокирована = &Заблокирована)
	|	И (&ИсключитьКарту = НЕОПРЕДЕЛЕНО
	|			ИЛИ Карты.Ссылка <> &ИсключитьКарту)
	|	И (&ПометкаУдаления = НЕОПРЕДЕЛЕНО
	|			ИЛИ Карты.ПометкаУдаления = &ПометкаУдаления)");
		
	Запрос.УстановитьПараметр("ВладелецКарты"  , Клиент);
	Запрос.УстановитьПараметр("ВидКарты"       , ВидКарты);
    Запрос.УстановитьПараметр("ТипКода"        , ТипКода);
	Запрос.УстановитьПараметр("Заблокирована"  , Заблокирована);
	Запрос.УстановитьПараметр("ИсключитьКарту" , ИсключитьКарту);
	Запрос.УстановитьПараметр("ПометкаУдаления", ПометкаУдаления);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Количество", ?(ЗначениеЗаполнено(КоличествоЗаписей), СтрШаблон("ПЕРВЫЕ %1", КоличествоЗаписей), ""));
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

// Функция создает карту клиента с указанными параметрами и возвращает ссылку на нее. 
// По умолчанию создается штриховая карта с кодом генерируемым автоматически.
Функция СоздатьКартуКлиента(
	Клиент,
	ВидКарты           = Неопределено,
	ТипКода            = Неопределено,
	КодКарты           = Неопределено,
	ВнутреннийКодКарты = Неопределено,
	Заблокирована      = Ложь,
	ВнешнийИсточник    = Ложь,
	СсылкаНаУстановку  = Неопределено) Экспорт
		
	НоваяКарта                    = Справочники.Карты.СоздатьЭлемент();
	НоваяКарта.ВладелецКарты      = Клиент;
	НоваяКарта.ВидКарты           = ВидКарты;
	НоваяКарта.ТипКода            = ?(ЗначениеЗаполнено(ТипКода), ТипКода, Перечисления.ВидыКарт.Штриховая);
	НоваяКарта.ДатаОткрытия       = ТекущаяДата();
	НоваяКарта.КодКарты           = ?(ЗначениеЗаполнено(КодКарты), КодКарты, РегистрыСведений.Штрихкоды.СформироватьШтрихкодEAN13());
	НоваяКарта.ВнутреннийКодКарты = ВнутреннийКодКарты;
    НоваяКарта.Заблокирована      = Заблокирована;
	НоваяКарта.Наименование       = ПолучитьНаименованиеКарты(НоваяКарта);
	НоваяКарта.СсылкаНаУстановкуКарты = СсылкаНаУстановку;
	
	Если ВнешнийИсточник Тогда
		НоваяКарта.ДополнительныеСвойства.Вставить("ВнешнийИсточник");
	КонецЕсли;
	
	НоваяКарта.Записать();
		
	Возврат НоваяКарта.Ссылка;
	
КонецФункции

// Функция вернет наименование карты по шаблону
Функция ПолучитьНаименованиеКарты(КартаОбъект) Экспорт
	
	Возврат ""+КартаОбъект.КодКарты +", " +КартаОбъект.ВладелецКарты + " (" + КартаОбъект.ТипКода + ")";
	
КонецФункции

// Функция, возвращает карту клиента.
// 
Функция ПолучитьКартуКлиента(Клиент) Экспорт
	
	Если Не ЗначениеЗаполнено(Клиент) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Карты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Карты КАК Карты
	|ГДЕ
	|	НЕ Карты.ПометкаУдаления
	|	И НЕ Карты.Заблокирована
	|	И Карты.ВладелецКарты = &ВладелецКарты");
	
	Запрос.УстановитьПараметр("ВладелецКарты", Клиент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.Ссылка, Неопределено);
	
КонецФункции

// Функция, возвращает карту wallet клиента.
// 
Функция ПолучитьКартыWalletКлиента(Клиент, ИсключаемыеКарты = Неопределено) Экспорт
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Карты.Ссылка КАК Карта
	|ИЗ
	|	Справочник.Карты КАК Карты
	|ГДЕ
	|	Карты.ВладелецКарты = &ВладелецКарты
	|	И НЕ Карты.ПометкаУдаления
	|	И НЕ Карты.Заблокирована
	|	И Карты.ТипКода = ЗНАЧЕНИЕ(Перечисление.ВидыКарт.Wallet)
	|	И НЕ Карты.ВнутреннийКодКарты = """"
	|	И &ФильтрПоКартам");
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &ФильтрПоКартам", ?(ЗначениеЗаполнено(ИсключаемыеКарты), "И Не Карты.Ссылка В (&ИсключаемыеКарты)", ""));
	
	Запрос.УстановитьПараметр("ВладелецКарты"   , Клиент);
	Запрос.УстановитьПараметр("ИсключаемыеКарты", ИсключаемыеКарты);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Карта");
	
КонецФункции

// Функция - Получить сотрудника по карте
// 
// Параметры:
//  КодКарты - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ПолучитьКартуПоКоду(Знач КодКарты = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Карты.Ссылка КАК Ссылка,
	               |	Карты.Заблокирована КАК Заблокирована,
	               |	Карты.ВладелецКарты КАК Сотрудник
	               |ИЗ
	               |	Справочник.Карты КАК Карты
	               |ГДЕ
	               |	НЕ Карты.ПометкаУдаления
	               |	И НЕ ВЫРАЗИТЬ(Карты.ВладелецКарты КАК Справочник.Сотрудники) ЕСТЬ NULL
	               |	И Карты.КодКарты ПОДОБНО &КодКарты";
	
	Запрос.УстановитьПараметр("КодКарты", СокрЛП(КодКарты));			   
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Функция, отправляет push wallet
// 
// Параметры:
//  СерийныйНомерКарты	 - 	 - 
//  ВнешняяСистемаWallet - 	 - 
//  Сообщение			 - 	 - 
// 
Функция ОтправитьPushWallet(МассивСообщений, ЭтоГрупповаяРассылка = Ложь) Экспорт
	
	ОтветСервера = ПолучитьСтруктуруВозврата();
	ВнешняяСистемаWallet = МассивСообщений[0].СервисРассылки;
	
	Попытка
		Соединение = Новый HTTPСоединение(ПолучитьАдресAPI(ВнешняяСистемаWallet),,,,,, Новый ЗащищенноеСоединениеOpenSSL());
		Заголовки  = Новый Соответствие;
		Заголовки.Вставить("X-Client-Id"    , ВнешняяСистемаWallet.ТокенДоступа);
		Заголовки.Вставить("X-Client-Secret", ВнешняяСистемаWallet.КлючШифрования);
		Заголовки.Вставить("Content-Type"   , "application/json");
		Push = Новый HTTPЗапрос("/v1/passes", Заголовки);
		Push.УстановитьТелоИзСтроки(СобратьJson(ПолучитьТелоЗапросаМассовойРассылки(МассивСообщений, ЭтоГрупповаяРассылка)));
		Результат = Соединение.ВызватьHTTPМетод("PATCH", Push);
		ОтветСоответствие = РазобратьJson(Результат, Истина);
		
	Исключение	
		ОтветСервера.ОписаниеОшибки = ОписаниеОшибки();
		Возврат ОтветСервера;
		
	КонецПопытки;
	
	Если Результат.КодСостояния = 200 Тогда
		
		ОтветСервера.Успешно = Истина;
		ОтветСервера.status	 = 200;
		ОтветСервера.data	 = ОтветСоответствие["data"];
		
		Возврат ОтветСервера;
		
	Иначе
		ПараметрыJson = РазобратьJson(Результат);
		ОтветСервера.ОписаниеОшибки = ОтветСоответствие["error"]["message"];
		Возврат ОтветСервера;
		
	КонецЕсли;
	
КонецФункции

// Функция - Разобрать json
// 
// Параметры:
//  РезультатЗапроса - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция РазобратьJson(РезультатЗапроса, ПрочитатьВСоответствие = Ложь)
	
	ТекстJSON  = РезультатЗапроса.ПолучитьТелоКакСтроку();	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТекстJSON);
	ПараметрыJSON = ПрочитатьJSON(ЧтениеJSON, ПрочитатьВСоответствие);
	
	Возврат ПараметрыJSON;
	
КонецФункции

// Функция - Собрать json
// 
// Параметры:
//  ТелоЗапроса	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция СобратьJson(ТелоЗапроса)
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписи);
	ЗаписатьJSON(ЗаписьJSON, ТелоЗапроса);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

// Функция, возвращает структуру возврата.
// 
Функция ПолучитьСтруктуруВозврата()
	
	СтруктураВозврата =  Новый Структура("КодКарты, ВнутреннийКодКарты, ОписаниеОшибки, Ссылка, status, id, data");
	
	СтруктураВозврата.Вставить("Успешно", Ложь);
	СтруктураВозврата.Вставить("СинхронизироватьНомерТелефона", Истина);
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Функция, возвращает признак участия клиента в рассылке.
// 
Функция КлиентУчаствуетВРассылкеWallet(Клиент) Экспорт
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Карты.Ссылка КАК Карта
	|ИЗ
	|	Справочник.Карты КАК Карты
	|ГДЕ
	|	Карты.ВладелецКарты = &ВладелецКарты
	|	И НЕ Карты.ПометкаУдаления
	|	И НЕ Карты.Заблокирована
	|	И Карты.ТипКода = ЗНАЧЕНИЕ(Перечисление.ВидыКарт.Wallet)");
		
	Запрос.УстановитьПараметр("ВладелецКарты", Клиент);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

// Функция, возвращает ссылку на установку карты wallet.
// 
Функция ПолучитьСсылкуНаУстановкуКартыWallet(СерийныйНомерКарты, ВнешняяСистема) Экспорт
	
	ОтветСервера = ПолучитьСтруктуруВозврата();
	
	Попытка		
		
		Соединение = Новый HTTPСоединение(ПолучитьАдресAPI(ВнешняяСистема),,,,,, Новый ЗащищенноеСоединениеOpenSSL()); 
		Заголовки  = Новый Соответствие;    
		Заголовки.Вставить("X-Client-Id"    , ВнешняяСистема.ТокенДоступа);
		Заголовки.Вставить("X-Client-Secret", ВнешняяСистема.КлючШифрования);
		
		ЗапросНаПолучениеКарты = Новый HTTPЗапрос("/v1/passes/" + СерийныйНомерКарты, Заголовки); 
		Результат = Соединение.Получить(ЗапросНаПолучениеКарты);					
		
	Исключение	
		
		ОтветСервера.ОписаниеОшибки = ОписаниеОшибки();
		Возврат ОтветСервера;
		
	КонецПопытки;
	
	Если Результат.КодСостояния = 200 Тогда
		
		ОтветСервера.Успешно = Истина;	
		ПараметрыJson        = РазобратьJson(Результат);
		ОтветСервера.Ссылка	 = ПараметрыJson.data.link; 
		
		Возврат ОтветСервера;
		
	Иначе	
		
		ПараметрыJson               = РазобратьJson(Результат);
		ОтветСервера.ОписаниеОшибки = ПараметрыJson.error.message;
		
		Возврат ОтветСервера;
		
	КонецЕсли;

	
КонецФункции

// Функция - возращает номер выданной карты.
// 
Функция ПолучитьНомерВыданнойКарты(ВладелецКарты, ВидКарты) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Карты.КодКарты КАК НомерКарты,
	|	Карты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Карты КАК Карты
	|ГДЕ
	|	Карты.ПометкаУдаления = ЛОЖЬ
	|	И Карты.Заблокирована = ЛОЖЬ
	|	И Карты.ВидКарты = &ВидКарты
	|	И Карты.ВладелецКарты = &ВладелецКарты");
	
	Запрос.УстановитьПараметр("ВидКарты"		, ВидКарты);
	Запрос.УстановитьПараметр("ВладелецКарты"	, ВладелецКарты);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат ?(Результат.Количество() = 0, Неопределено, Результат[0].НомерКарты);
	
КонецФункции

// Функция, обрабатывает вебхук.
// 
Функция ОбработатьВебХук(ВнешняяСистема, ПараметрыJSON) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// вытягиваем карту по ид или коду.
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Карты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Карты КАК Карты
	|ГДЕ
	|	&ФильтрПоВнутреннемуКодуКартыИлиКодуКарты");
	
	МассивСобытий = Новый_Массив("PassRegistered", "PassUnregistered");
	
	// Для событий PassRegistered и PassUnregistered серийный номер карты прилетает в свойстве pass_serial_number
	
	ИмяСвойства = ?(МассивСобытий.Найти(ПараметрыJSON.event) <> Неопределено, "pass_serial_number", "serial_number");
	
	Запрос.УстановитьПараметр("ВнутреннийКодКарты", ПараметрыJSON.data[ИмяСвойства]);
	
	Если ПараметрыJSON.event = "PassCreated" Тогда
		
		ТекстФильтра = "Карты.ВнутреннийКодКарты = &ВнутреннийКодКарты Или Карты.КодКарты = &КодКарты";
		
		Запрос.УстановитьПараметр("КодКарты", ПараметрыJSON.data.pass_number);
		
	Иначе
		
		ТекстФильтра = "Карты.ВнутреннийКодКарты = &ВнутреннийКодКарты";
		
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ФильтрПоВнутреннемуКодуКартыИлиКодуКарты", ТекстФильтра);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Карта = ?(Выборка.Следующий(), Выборка.Ссылка, Неопределено);

	
	Если ЗначениеЗаполнено(Карта) Тогда
		
		КартаОбъект = Карта.ПолучитьОбъект();
		
		Если ПараметрыJSON.event = "PassRegistered" Тогда
			
			КартаОбъект.КоличествоУстановок = КартаОбъект.КоличествоУстановок + 1;				
			
		ИначеЕсли ПараметрыJSON.event = "PassUnregistered" Тогда
			
			КартаОбъект.КоличествоУстановок = КартаОбъект.КоличествоУстановок - 1;
			
		ИначеЕсли ПараметрыJSON.event = "PassUpdated" Тогда
			
			Если Карта.ПометкаУдаления = Ложь И ПараметрыJSON.data.Свойство("changes") И ПараметрыJSON.data.changes.Свойство("voided") И ПараметрыJSON.data.changes.voided = Истина Тогда 
				
				КартаОбъект.КартаУдалена = Истина;
				КартаОбъект.ПометкаУдаления = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
		Попытка
			
			КартаОбъект.ДополнительныеСвойства.Вставить("ВидЭлектроннойКарты"	, "Wallet");
			КартаОбъект.ДополнительныеСвойства.Вставить("ЭтоНовый"				, Ложь);			
			КартаОбъект.Записать();
			
		Исключение
			
			Возврат ПолучитьСтруктуруОшибки(5004, ОписаниеОшибки());	
			
		КонецПопытки;
		
	Иначе
				
		Если ПараметрыJSON.event = "PassCreated" Тогда // создание карты 
			
			НомерТелефона = ПараметрыJSON.data.fields.phone_number;
			АдресЭП       = ПараметрыJSON.data.fields.email;
			Имя           = ПараметрыJSON.data.fields.first_name;
			Фамилия       = ПараметрыJSON.data.fields.last_name;
			ДатаРождения  = ПараметрыJSON.data.fields.birthdate;
			
			СсылкаНаУстановку    = ПараметрыJSON.data.link;
			КодКарты 		     = ПараметрыJSON.data.pass_number;
			ВнутреннийКодКарты   = ПараметрыJSON.data.serial_number;
			ИдентификаторПроекта = ПараметрыJSON.data.project_id;
			
			ВидКарты = ПолучитьВидКартыWalletПоИдентификатору(ИдентификаторПроекта);
			
			Если Не ЗначениеЗаполнено(ВидКарты) Тогда
				
				ОписаниеОшибки = "";
				
				ВидКарты = СоздатьВидКарты(ИдентификаторПроекта, ВнешняяСистема, ОписаниеОшибки);
				
				Если Не ЗначениеЗаполнено(ВидКарты) Тогда
					
					Возврат ПолучитьСтруктуруОшибки(5003, "Не удалось создать вид карты. " + ОписаниеОшибки);	
					
				КонецЕсли;
				
			КонецЕсли;
			
			Клиент = Неопределено;
			
			Если ЗначениеЗаполнено(НомерТелефона) Тогда
				
				Клиент = Справочники.Контрагенты.ПолучитьКонтрагентаПоНомеруТелефона(НомерТелефона);
				
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Клиент) И ЗначениеЗаполнено(АдресЭП) Тогда
				
				Клиент = Справочники.Контрагенты.ПолучитьКонтрагентаПоEmail(АдресЭП);
				
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Клиент) Тогда
				
				Попытка
					
					Клиент = Справочники.Контрагенты.СоздатьКлиента(
					Фамилия,
					Имя,, 
					НомерТелефона, 
					АдресЭП,,
					ДатаРождения
					);
					
				Исключение
					
					Возврат ПолучитьСтруктуруОшибки(5005, ОписаниеОшибки());
					
				КонецПопытки;
				
			КонецЕсли;
			
			Попытка
				
				СоздатьКартуКлиента(Клиент, ВидКарты, Перечисления.ВидыКарт.Wallet, КодКарты, ВнутреннийКодКарты,, Истина, СсылкаНаУстановку); 
				
			Исключение
				
				Возврат ПолучитьСтруктуруОшибки(5006, ОписаниеОшибки());
				
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Новый Структура("Result", Истина);
	
КонецФункции

// Функция, возвращает вид карты по идентификатору.
// 
Функция ПолучитьВидКартыWalletПоИдентификатору(ИдентификаторПроекта)
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВидыКарт.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыКарт КАК ВидыКарт
	|ГДЕ
	|	ВидыКарт.ИдентификаторПроекта = &ИдентификаторПроекта");	
	
	Запрос.УстановитьПараметр("ИдентификаторПроекта", ИдентификаторПроекта);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.Ссылка, Неопределено);
	
КонецФункции

// Функция, создает и возвращает ссылку на вид карты.
// 
Функция СоздатьВидКарты(ИдентификаторПроекта, ВнешняяСистемаWallet, ОписаниеОшибки)
	
	РезультатЗапроса = ПолучитьДанныеПроекта(ИдентификаторПроекта, ВнешняяСистемаWallet);		
	
	Если РезультатЗапроса.Успешно Тогда
		
		Попытка
			
			ВидКартыОбъект = Справочники.ВидыКарт.СоздатьЭлемент();
			ВидКартыОбъект.Наименование = РезультатЗапроса.data.name;
			ВидКартыОбъект.ИдентификаторПроекта = ИдентификаторПроекта;
			ВидКартыОбъект.ТипКода = Перечисления.ВидыКарт.Wallet;
			
			ВидКартыОбъект.Записать();
			
		Исключение
			
			ОписаниеОшибки = ОписаниеОшибки();
			
			Возврат Неопределено;
			
		КонецПопытки;
		
		Возврат ВидКартыОбъект.Ссылка;
		
	Иначе
		
		ОписаниеОшибки = РезультатЗапроса.ОписаниеОшибки;
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

// Функция, возвращает структуру ошибки.
// 
Функция ПолучитьСтруктуруОшибки(КодОшибки, ОписаниеОшибки)
	
	Возврат Новый Структура("Result, Error, ErrorMessage", Ложь, КодОшибки, ОписаниеОшибки);		
	
КонецФункции

// Функция, возвращает данные проекта Wallet.
// 
Функция ПолучитьДанныеПроекта(ИдентификаторПроекта, ВнешняяСистемаWallet)
	
	РезультатЗапроса = ПолучитьСтруктуруВозврата();
	
	Попытка		
		
		Соединение = Новый HTTPСоединение(ПолучитьАдресAPI(ВнешняяСистемаWallet),,,,,, Новый ЗащищенноеСоединениеOpenSSL()); 
		Заголовки  = Новый Соответствие;    
		Заголовки.Вставить("X-Client-Id"    , ВнешняяСистемаWallet.ТокенДоступа);
		Заголовки.Вставить("X-Client-Secret", ВнешняяСистемаWallet.КлючШифрования);
				
		Запрос = Новый HTTPЗапрос("/v1/projects/" + ИдентификаторПроекта, Заголовки); 
		
		Результат = Соединение.Получить(Запрос);					
		
	Исключение	
		
		РезультатЗапроса.ОписаниеОшибки = "Wallet: " + ОписаниеОшибки();	
		
		Возврат РезультатЗапроса;
		
	КонецПопытки;
	
	ПараметрыJson = РазобратьJson(Результат);
	
	Если Результат.КодСостояния = 200 Тогда
			
		РезультатЗапроса.Успешно = Истина;
		РезультатЗапроса.data	 = ПараметрыJson.data;
		
		Возврат РезультатЗапроса;
		
	Иначе
		
		РезультатЗапроса.ОписаниеОшибки = "Wallet: " + ПараметрыJson.error.message;
		
		Возврат РезультатЗапроса;
		
	КонецЕсли;		
	
КонецФункции

// Функция, обновляет ВебХук.
// 
Функция ОбновитьВебХук(ВнешняяСистемаWallet, ВебХукИД, ОбработчикСобытия) Экспорт
	
	РезультатОбновления = ПолучитьСтруктуруВозврата();
	
	Попытка		
		
		Соединение = Новый HTTPСоединение(ПолучитьАдресAPI(ВнешняяСистемаWallet),,,,,, Новый ЗащищенноеСоединениеOpenSSL()); 
		
		Заголовки  = Новый Соответствие;    
		Заголовки.Вставить("X-Client-Id"    , ВнешняяСистемаWallet.ТокенДоступа);
		Заголовки.Вставить("X-Client-Secret", ВнешняяСистемаWallet.КлючШифрования);
		Заголовки.Вставить("Content-Type"   , "application/json");
		
		ЗапросНаИзменениеХука = Новый HTTPЗапрос("/v1/webhooks/" + ВебХукИД, Заголовки); 
		
		ЗапросНаИзменениеХука.УстановитьТелоИзСтроки(СобратьJson(Новый Структура("url", ОбработчикСобытия)));
		
		Результат = Соединение.ВызватьHTTPМетод("PATCH", ЗапросНаИзменениеХука);					
		
	Исключение	
		
		РезультатОбновления.ОписаниеОшибки = "Wallet: " + ОписаниеОшибки();		
		Возврат РезультатОбновления;
		
	КонецПопытки;
		
	Если Результат.КодСостояния = 200 Тогда
		
		РезультатОбновления.Успешно = Истина;		
		Возврат РезультатОбновления;
		
	Иначе
		
		ПараметрыJson = РазобратьJson(Результат);
		
		РезультатОбновления.ОписаниеОшибки = "Wallet: " + ПараметрыJson.error.message;
		Возврат РезультатОбновления;
		
	КонецЕсли;		
	
КонецФункции

// Функция, регистрирует ВебХук.
// 
Функция УстановитьВебХук(ВнешняяСистемаWallet, ИмяВебХука, Событие, ОбработчикСобытия, ИдПроектов = Неопределено, Глобальный = Истина) Экспорт
	
	РезультатСоздания = ПолучитьСтруктуруВозврата();
	
	Попытка		
		
		Соединение = Новый HTTPСоединение(ПолучитьАдресAPI(ВнешняяСистемаWallet),,,,,, Новый ЗащищенноеСоединениеOpenSSL()); 
		Заголовки  = Новый Соответствие;    
		Заголовки.Вставить("X-Client-Id"    , ВнешняяСистемаWallet.ТокенДоступа);
		Заголовки.Вставить("X-Client-Secret", ВнешняяСистемаWallet.КлючШифрования);
		Заголовки.Вставить("Content-Type"   , "application/json");
		
		ТелоЗапроса = Новый Структура("event, url, global", Событие, ОбработчикСобытия, Глобальный);
		
		Если Не Глобальный Тогда
			ТелоЗапроса.Вставить("projects", ИдПроектов); 		
		КонецЕсли;
		
		ЗапросНаСозданиеВебХука = Новый HTTPЗапрос("/v1/webhooks", Заголовки); 
		ЗапросНаСозданиеВебХука.УстановитьТелоИзСтроки(СобратьJson(ТелоЗапроса));
		Результат = Соединение.ОтправитьДляОбработки(ЗапросНаСозданиеВебХука);					
		
	Исключение	
		
		РезультатСоздания.ОписаниеОшибки = "Wallet: " + ОписаниеОшибки();	
		
		Возврат РезультатСоздания;
		
	КонецПопытки;
	
	ПараметрыJson = РазобратьJson(Результат);
	
	Если Результат.КодСостояния = 201 Тогда
			
		РезультатСоздания.Успешно = Истина;
		РезультатСоздания.id	  = ПараметрыJson.data.id;
		
		Возврат РезультатСоздания;
		
	Иначе
		
		РезультатСоздания.ОписаниеОшибки = "Wallet: " + ПараметрыJson.error.message;
		Возврат РезультатСоздания;
		
	КонецЕсли;		
	
КонецФункции

// Процедура, выполняет синхронизацию видов карт.
// 
Процедура СинхронизироватьВидыКарт(ВидыКарт) Экспорт
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|  ВидыКарт.Ссылка КАК Ссылка,
	|  ВидыКарт.ИдентификаторПроекта КАК ИдентификаторПроекта
	|ИЗ
	|  Справочник.ВидыКарт КАК ВидыКарт
	|ГДЕ
	|  ВидыКарт.ИдентификаторПроекта В(&МассивИдентификаторов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|  ВидыКарт.Ссылка КАК Ссылка,
	|  ВидыКарт.ИдентификаторПроекта КАК ИдентификаторПроекта
	|ИЗ
	|  Справочник.ВидыКарт КАК ВидыКарт
	|ГДЕ
	|  ВидыКарт.ИдентификаторПроекта <> 0
	|  И НЕ ВидыКарт.ИдентификаторПроекта В (&МассивИдентификаторов)
	|  И НЕ ВидыКарт.ПометкаУдаления");
	
	Запрос.УстановитьПараметр("МассивИдентификаторов", ВидыКарт.ВыгрузитьЗначения());
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	СуществующиеКарты = РезультатЗапроса[0].Выгрузить();
	НенайденныеКарты  = РезультатЗапроса[1].Выгрузить();
	
	Если ЗначениеЗаполнено(СуществующиеКарты) Или ЗначениеЗаполнено(НенайденныеКарты) Тогда
		
		// обновить существующие виды карт
		Для Каждого ВидКарты Из СуществующиеКарты Цикл
			
			ВидКартыОбъект = ВидКарты.Ссылка.ПолучитьОбъект();
			ВидКартыОбъект.Наименование = ВидыКарт.НайтиПоЗначению(ВидКарты.ИдентификаторПроекта).Представление;
			ВидКартыОбъект.ПометкаУдаления = Ложь;
			ВидКартыОбъект.Записать();
			
		КонецЦикла;
		
		// пометить на удаление ненайденные карты
		Для Каждого ВидКарты Из НенайденныеКарты Цикл
			
			ВидКартыОбъект = ВидКарты.Ссылка.ПолучитьОбъект();
			ВидКартыОбъект.УстановитьПометкуУдаления(Истина);  
			
		КонецЦикла;
		
	КонецЕсли;
	
	МассивСуществующихВидовКарт = СуществующиеКарты.ВыгрузитьКолонку("ИдентификаторПроекта");
	
	// добавить новые виды карт
	Для Каждого ВидКарты Из ВидыКарт Цикл
		
		Если МассивСуществующихВидовКарт.Найти(ВидКарты.Значение) = Неопределено Тогда
			
			ВидКартыОбъект = Справочники.ВидыКарт.СоздатьЭлемент();
			
			ВидКартыОбъект.ИдентификаторПроекта = ВидКарты.Значение;
			ВидКартыОбъект.Наименование = ВидКарты.Представление;
			ВидКартыОбъект.ТипКода = Перечисления.ВидыКарт.Wallet;
			ВидКартыОбъект.Именная = Истина;
			
			ВидКартыОбъект.Записать();
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Функция, создает проект электронной карты.
// 
Функция СоздатьПроектWallet(ВСWallet, ИмяПроекта, Нумератор, Сертификат) Экспорт
	
	РезультатЗапроса = ПолучитьСтруктуруВозврата();
		
	Попытка
		
		Соединение = Новый HTTPСоединение(ПолучитьАдресAPI(ВСWallet),,,,,, Новый ЗащищенноеСоединениеOpenSSL()); 
		Заголовки  = Новый Соответствие;    
		Заголовки.Вставить("X-Client-Id"    , ВСWallet.ТокенДоступа);
		Заголовки.Вставить("X-Client-Secret", ВСWallet.КлючШифрования);
		Заголовки.Вставить("Content-Type"   , "application/json");
		Запрос = Новый HTTPЗапрос("/v1/projects", Заголовки);
		Запрос.УстановитьТелоИзСтроки(СобратьJson(ПолуТелоЗапросаСозданияПроекта(ИмяПроекта, Нумератор, Сертификат)));
		Результат = Соединение.ОтправитьДляОбработки(Запрос);					
		
	Исключение	
		
		РезультатЗапроса.ОписаниеОшибки = "Wallet: " + ОписаниеОшибки();		
		Возврат РезультатЗапроса;
	
	КонецПопытки;
	
	ПараметрыJson = РазобратьJson(Результат);
	
	Если Результат.КодСостояния = 201 Тогда
		
		РезультатЗапроса.Успешно = Истина;
		РезультатЗапроса.id      = ПараметрыJson.data.id;
		Возврат РезультатЗапроса;
				
	Иначе
		
		РезультатЗапроса.ОписаниеОшибки = "Wallet: " + ПараметрыJson.error.message;		
		Возврат РезультатЗапроса;
		
	КонецЕсли;		
	
КонецФункции

// Функция, возвращает тело запроса на создание проекта.
// 
Функция ПолуТелоЗапросаСозданияПроекта(ИмяПроекта, Нумератор, Сертификат)
	
	ПараметрыJson = Новый Структура;
	ПараметрыJson.Вставить("name"			, ИмяПроекта);
	ПараметрыJson.Вставить("numerator_id"	, Нумератор);
	ПараметрыJson.Вставить("integrations"	, Новый_Массив("Stoma1c"));
    ПараметрыJson.Вставить("certificate_id"	, Сертификат);

	Возврат ПараметрыJson;
	
КонецФункции

// Функция, возвращает тело запроса на рассылку push-сообщений.
// 
Функция ПолучитьТелоЗапросаМассовойРассылки(МассивСообщений, ЭтоГрупповаяРассылка = Ложь)
	
	ПараметрыJson = Новый Массив;
	
	Для Каждого Сообщение Из МассивСообщений Цикл
		Если ЗначениеЗаполнено(Сообщение.ВнутреннийКодКарты) Тогда
			ПараметрыJson.Добавить(ПолучитьСтруктуруPushСообщения(Сообщение, ЭтоГрупповаяРассылка));
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПараметрыJson;
		
КонецФункции

// Функция, возвращает структуру параметров для отправки push-сообщения.
// 
Функция ПолучитьСтруктуруPushСообщения(ДанныеСообщения, ЭтоГрупповаяРассылка = Ложь)
	
	ИмяПоля			 = ?(ЭтоГрупповаяРассылка, "news", "message");
	ИконкаСообщения	 = ПолучитьИконкиУведомлений().Сообщение;
	
	СтруктураСообщения = Новый Структура;
	СтруктураСообщения.Вставить("serial_number"	, ДанныеСообщения.ВнутреннийКодКарты);
	СтруктураСообщения.Вставить("fields"		, Новый Структура(ИмяПоля, ИконкаСообщения + ДанныеСообщения.ТекстСообщения));
	
	Возврат СтруктураСообщения;
	
КонецФункции

// Функция, возвращает массив полей проекта.
// 
Функция ПолучитьМассивПолейПроекта()
	
	МассивПолей = Новый Массив();
	
	МассивПолей.Добавить(НовоеПолеПроекта("Имя"               , "first_name"   		 , "Text"));
	МассивПолей.Добавить(НовоеПолеПроекта("Фамилия"           , "last_name"    		 , "Text"));
	МассивПолей.Добавить(НовоеПолеПроекта("Номер телефона"    , "phone_number" 		 , "PhoneNumber", Новый Структура("unique", Ложь)));
	МассивПолей.Добавить(НовоеПолеПроекта("Емейл"             , "email"        		 , "Email"      , Новый Структура("unique", Ложь)));
	МассивПолей.Добавить(НовоеПолеПроекта("Дата рождения"     , "birthdate"    		 , "DateTime"));
	МассивПолей.Добавить(НовоеПолеПроекта("Личное сообщение"  , "message"      		 , "Text"));
	МассивПолей.Добавить(НовоеПолеПроекта("Курсы"             , "courses"      		 , "Text"));
	МассивПолей.Добавить(НовоеПолеПроекта("Лицевые счета"     , "accounts"     		 , "Text"));
	МассивПолей.Добавить(НовоеПолеПроекта("Бонусы"            , "bonuses"      		 , "Text"));
	МассивПолей.Добавить(НовоеПолеПроекта("Баланс"            , "balance"      		 , "Text"));
	МассивПолей.Добавить(НовоеПолеПроекта("Новости"           , "news"         		 , "Text"));
	МассивПолей.Добавить(НовоеПолеПроекта("Предстоящие визиты", "visits"     		 , "Text"));
	МассивПолей.Добавить(НовоеПолеПроекта("Пакеты услуг"      , "packages"   		 , "Text"));
	МассивПолей.Добавить(НовоеПолеПроекта("Баланс сертификата", "certificate_balance", "Text"));
	
	МассивПолей.Добавить(НовоеПолеПроекта("Ссылка на онлайн-запись", "link", "Text"));
	
	Возврат МассивПолей;
	
КонецФункции

// Функция, возвращает структуру поля проекта.
// 
Функция НовоеПолеПроекта(Имя, Атрибут, Тип, Настройки = Неопределено, ОбязательноДляЗаполнения = Ложь)
	
	НовоеПоле = Новый Структура("name, attribute, type, required", Имя, Атрибут, Тип, ОбязательноДляЗаполнения);
	
	Если ЗначениеЗаполнено(Настройки) Тогда
		НовоеПоле.Вставить("settings", Настройки);	
	КонецЕсли;
	
	Возврат НовоеПоле;
	
КонецФункции

// Процедура, обработчик получения формы.
// 
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" Тогда

		СтандартнаяОбработка = Ложь;
		
		Если Параметры.Свойство("Ключ") Тогда
			
			ВыбраннаяФорма = "ФормаЭлемента";
			
		Иначе
			
			ВыбраннаяФорма = "ФормаНовогоЭлемента";
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Функция, возвращает иконки уведомлений.
// 
Функция ПолучитьИконкиУведомлений() Экспорт
	
	Иконки = Новый Структура();
	
	Иконки.Вставить("Услуга"     , Символ(9210));
	Иконки.Вставить("Бонусы"     , Символ(55356) + Символ(57286));  
	Иконки.Вставить("ЛицевойСчет", Символ(55357) + Символ(56499));
	Иконки.Вставить("Сообщение"  , Символ(55357) + Символ(56556)); 
	Иконки.Вставить("Прием"      , Символ(55357) + Символ(56657));

	Возврат Иконки;
	
КонецФункции

// Функция, обновляет электронные карты.
// 
Функция ОбновитьКарты(МассивДанныхДляОбновления, ВнешняяСистемаWallet) Экспорт

	ОтветСервера = ПолучитьСтруктуруВозврата();
	
	Попытка		
		
		Соединение = Новый HTTPСоединение(ПолучитьАдресAPI(ВнешняяСистемаWallet),,,,,, Новый ЗащищенноеСоединениеOpenSSL()); 
		Заголовки  = Новый Соответствие;    
		Заголовки.Вставить("X-Client-Id"    , ВнешняяСистемаWallet.ТокенДоступа);
		Заголовки.Вставить("X-Client-Secret", ВнешняяСистемаWallet.КлючШифрования);
		Заголовки.Вставить("Content-Type"   , "application/json");
		
		ОбновитьКарты = Новый HTTPЗапрос("/v1/passes/", Заголовки); 
			
		ТекстJSON = СобратьJson(МассивДанныхДляОбновления);
		ТекстJSON = СтрЗаменить(ТекстJSON, "\\n", "\n"); 
		
		ОбновитьКарты.УстановитьТелоИзСтроки(ТекстJSON);
		
		Результат = Соединение.ВызватьHTTPМетод("PATCH", ОбновитьКарты);					
		
	Исключение	
		
		ОтветСервера.ОписаниеОшибки = ОписаниеОшибки();
		
		Возврат ОтветСервера;
		
	КонецПопытки;
	
	ПараметрыJson = РазобратьJson(Результат, Истина); // если сериализовать в структуру крашится из-за id карты
	
	Если Результат.КодСостояния = 200 Тогда
		
		ОтветСервера.data    = ПараметрыJson["data"];
		ОтветСервера.Успешно = Истина;
		
		Возврат ОтветСервера;
		
	Иначе	
		
		ОтветСервера.ОписаниеОшибки = ПараметрыJson["error"]["message"];
		
		Возврат ОтветСервера;
		
	КонецЕсли;	
	
КонецФункции

// Функция, создает карту wallet.
// 
Функция СоздатьКартуWallet(ВнешняяСистемаWallet, ИдентификаторПроекта, ВладелецКарты) Экспорт
	
	РезультатСоздания = ПолучитьСтруктуруВозврата();
	
	ОтветСервера = ПолучитьДанныеПроекта(ИдентификаторПроекта, ВнешняяСистемаWallet);
	
	Если Не ОтветСервера.Успешно Тогда
		
		РезультатСоздания.ОписаниеОшибки = ОтветСервера.ОписаниеОшибки;					
		
		Возврат РезультатСоздания;	
		
	КонецЕсли;
	
   	ТелефонОбязателенДляЗаполнения = Ложь;
	
	ПолеНомерТелефона = ОбщегоНазначенияКлиентСерверСтоматология.НайтиВМассивеСтруктур(ОтветСервера.data.fields, "attribute", "phone_number");
	
	Если ЗначениеЗаполнено(ПолеНомерТелефона)
		И ПолеНомерТелефона.Свойство("required") Тогда
		
		ТелефонОбязателенДляЗаполнения = ПолеНомерТелефона.required; 	
		
	КонецЕсли;
	
	РезультатСоздания.СинхронизироватьНомерТелефона = НЕ ТелефонОбязателенДляЗаполнения;
		
	Попытка		
		
		Соединение = Новый HTTPСоединение(ПолучитьАдресAPI(ВнешняяСистемаWallet),,,,,, Новый ЗащищенноеСоединениеOpenSSL()); 
		Заголовки  = Новый Соответствие;    
		Заголовки.Вставить("X-Client-Id"    , ВнешняяСистемаWallet.ТокенДоступа);
		Заголовки.Вставить("X-Client-Secret", ВнешняяСистемаWallet.КлючШифрования);
		Заголовки.Вставить("Content-Type"   , "application/json");
		ЗапросНаСозданиеКарты = Новый HTTPЗапрос("/v1/passes", Заголовки); 
		ЗапросНаСозданиеКарты.УстановитьТелоИзСтроки(ПолучитьТелоЗапроса(ВладелецКарты, ИдентификаторПроекта,,, ТелефонОбязателенДляЗаполнения));
		Результат = Соединение.ОтправитьДляОбработки(ЗапросНаСозданиеКарты);					
		
	Исключение	
		
		РезультатСоздания.ОписаниеОшибки = "Wallet: " + ОписаниеОшибки();	
		
		Возврат РезультатСоздания;
		
	КонецПопытки;
	
	ПараметрыJson = РазобратьJson(Результат, Истина);
	
	Если Результат.КодСостояния = 201 Тогда
		
		РезультатСоздания.Успешно = Истина;
		РезультатСоздания.ВнутреннийКодКарты = ПараметрыJson["data"]["serial_number"];
		РезультатСоздания.КодКарты			 = ПараметрыJson["data"]["pass_number"];
		РезультатСоздания.Ссылка   			 = ПараметрыJson["data"]["link"];
		
		Возврат РезультатСоздания;
		
	Иначе
		
		РезультатСоздания.ОписаниеОшибки = "Wallet: " + ПараметрыJson["error"]["message"];
		Возврат РезультатСоздания;
		
	КонецЕсли;
	
КонецФункции

// Функция, обновляет карту wallet.
// 
Функция ОбновитьКартуWallet(Карта, ВнешняяСистемаWallet, СменаВладельца = Ложь, Аннулирована = Ложь) Экспорт
	
	РезультатОбновления = ПолучитьСтруктуруВозврата();
	
	Попытка		
		
		Соединение = Новый HTTPСоединение(ПолучитьАдресAPI(ВнешняяСистемаWallet),,,,,, Новый ЗащищенноеСоединениеOpenSSL()); 
		
		Заголовки  = Новый Соответствие;    
		Заголовки.Вставить("X-Client-Id"    , ВнешняяСистемаWallet.ТокенДоступа);
		Заголовки.Вставить("X-Client-Secret", ВнешняяСистемаWallet.КлючШифрования);
		Заголовки.Вставить("Content-Type"   , "application/json");
		
		ЗапросНаОбновление = Новый HTTPЗапрос("/v1/passes/" + Карта.ВнутреннийКодКарты, Заголовки); 
		
		ЗапросНаОбновление.УстановитьТелоИзСтроки(ПолучитьТелоЗапроса(Карта.ВладелецКарты,,, СменаВладельца,, Аннулирована));
		Результат = Соединение.ВызватьHTTPМетод("PATCH", ЗапросНаОбновление);					
		
	Исключение	
		
		РезультатОбновления.ОписаниеОшибки = "Wallet: " + ОписаниеОшибки();
		Возврат РезультатОбновления;
		
	КонецПопытки;
	
	Если Результат.КодСостояния <> 200 Тогда
		
		ПараметрыJson = РазобратьJson(Результат);
		РезультатОбновления.ОписаниеОшибки = "Wallet: " + ПараметрыJson.error.message;
		Возврат РезультатОбновления;
		
	Иначе
		
		РезультатОбновления.Успешно = Истина;
		Возврат РезультатОбновления;
		
	КонецЕсли;
	
КонецФункции

// Функция, обновляет карту wallet.
//
Функция УдалитьКартуWallet(Карта, ВнешняяСистемаWallet) Экспорт
	
	РезультатУдаления = ПолучитьСтруктуруВозврата();
	
	Попытка
		
		Соединение = Новый HTTPСоединение(ПолучитьАдресAPI(ВнешняяСистемаWallet),,,,,, Новый ЗащищенноеСоединениеOpenSSL());
		
		Заголовки  = Новый Соответствие;    
		Заголовки.Вставить("X-Client-Id"    , ВнешняяСистемаWallet.ТокенДоступа);
		Заголовки.Вставить("X-Client-Secret", ВнешняяСистемаWallet.ИдентификаторКлиента);
		Заголовки.Вставить("Content-Type"   , "application/json");
		
		ЗапросНаУдаление = Новый HTTPЗапрос("/v1/passes/" + Карта.ВнутреннийКодКарты, Заголовки); 
		
		// ЗапросНаУдаление.УстановитьТелоИзСтроки(ПолучитьТелоЗапроса(Карта.ВладелецКарты));
		Результат = Соединение.ВызватьHTTPМетод("DELETE", ЗапросНаУдаление);					
		
	Исключение	
		
		РезультатУдаления.ОписаниеОшибки = "Wallet: " + ОписаниеОшибки();
		Возврат РезультатУдаления;
		
	КонецПопытки;
	
	Если Результат.КодСостояния <> 200 Тогда
		
		ПараметрыJson = РазобратьJson(Результат);
		РезультатУдаления.ОписаниеОшибки = "Wallet: " + ПараметрыJson.error.message;
		Возврат РезультатУдаления;
		
	Иначе
		
		РезультатУдаления.Успешно = Истина;
		Возврат РезультатУдаления;
		
	КонецЕсли;
	
КонецФункции 

// Функция, возвращает тело запроса для создания карты.
// 
Функция ПолучитьТелоЗапроса(ВладелецКарты, ИдентификаторПроекта = Неопределено, МассивВнутренныхКодов = Неопределено, СменаВладельца = Ложь, ТелефонОбязателенДляЗаполнения = Ложь, Аннулирована = Ложь)
	
	ВладелецКонтрагент = ТипЗнч(ВладелецКарты) = Тип("СправочникСсылка.Контрагенты");
	
	ТелоЗапросаСозданиеКарты = Новый Структура("project_id, fields", ИдентификаторПроекта);
	
	ДатаРождения = ?(ВладелецКонтрагент, ВладелецКарты.ДатаРожденияКлиента, ВладелецКарты.ДатаРождения);
	
	ТелоЗапросаОбновлениеКарты = Новый Структура("first_name, last_name");
	
	ТелоЗапросаОбновлениеКарты.first_name = ВладелецКарты.Имя;
	ТелоЗапросаОбновлениеКарты.last_name  = ВладелецКарты.Фамилия;
	
	Если ЗначениеЗаполнено(ДатаРождения) Тогда	
		ТелоЗапросаОбновлениеКарты.Вставить("birthdate", Формат(ДатаРождения, "ДФ=yyyy-MM-dd"));
	КонецЕсли;
	
	Если ВладелецКонтрагент Тогда
		КонтактнаяИнформация = Справочники.Контрагенты.ПолучитьКонтактнуюИнформациюКлиента(ВладелецКарты, Истина);  
	Иначе
		КонтактнаяИнформация = Справочники.Сотрудники.ПолучитьКонтактнуюИнформацию(ВладелецКарты, Истина); 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КонтактнаяИнформация.Email) Тогда
		ТелоЗапросаОбновлениеКарты.Вставить("email", КонтактнаяИнформация.Email);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КонтактнаяИнформация.Телефон) И ТелефонОбязателенДляЗаполнения Тогда
		НомерТелефонаВрем = ?(Лев(КонтактнаяИнформация.Телефон, 1) = "+", КонтактнаяИнформация.Телефон, "+" + КонтактнаяИнформация.Телефон);
		ТелоЗапросаОбновлениеКарты.Вставить("phone_number", НомерТелефонаВрем);
	КонецЕсли;
	
	Если Аннулирована = Истина Тогда
		ТелоЗапросаОбновлениеКарты.Вставить("voided", true);
	КонецЕсли;
	
	ТелоЗапросаСозданиеКарты.fields = ТелоЗапросаОбновлениеКарты;
	
	ИконкиУведомлений   = ПолучитьИконкиУведомлений();
	СимвольныйКодВалюты = ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодЦелойчастиВалюты();
	
	ДобавитьДанныеВОбновляемыеПоля(
		?(ЗначениеЗаполнено(ИдентификаторПроекта), ТелоЗапросаСозданиеКарты.fields, ТелоЗапросаОбновлениеКарты), 
		?(ВладелецКонтрагент, ВладелецКарты, ВладелецКарты.Контрагент), 
		ИконкиУведомлений, 
		СимвольныйКодВалюты, 
		СменаВладельца);
	
	Если ЗначениеЗаполнено(ИдентификаторПроекта) Тогда 
		
		Возврат СтрЗаменить(СобратьJson(ТелоЗапросаСозданиеКарты), "\\n", "\n");	
		
	Иначе 
		
		Возврат СтрЗаменить(СобратьJson(?(ЗначениеЗаполнено(МассивВнутренныхКодов), 
		Новый Структура("serial_numbers, fields", МассивВнутренныхКодов, ТелоЗапросаОбновлениеКарты), 
		ТелоЗапросаОбновлениеКарты)), "\\n", "\n");
		
	КонецЕсли;
	
КонецФункции

// Процедура, добавить данные в обновляемые поля.
// 
Процедура ДобавитьДанныеВОбновляемыеПоля(ПоляКарты, ВладелецКарты, ИконкиУведомлений, СимвольныйКодВалюты, СменаВладельца)
	
	ПоляКарты.Вставить("visits"   , "");
	ПоляКарты.Вставить("accounts" , "");
	ПоляКарты.Вставить("bonuses"  , "");
	ПоляКарты.Вставить("balance"  , "");
	ПоляКарты.Вставить("debt"	  , "");
		
	Если Не СменаВладельца Тогда
		ПоляКарты.Вставить("link", "");		
	КонецЕсли;
	
	ОбменДаннымиСерверСтоматология.ДобавитьЗапланированныеПриемыВОбновляемыеПоля(ПоляКарты.visits, ВладелецКарты, ИконкиУведомлений);
	ОбменДаннымиСерверСтоматология.ДобавитьЛицевыеСчетаВОбновляемыеПоля(ПоляКарты.accounts, ПоляКарты.balance, ВладелецКарты, ИконкиУведомлений, СимвольныйКодВалюты);
	ОбменДаннымиСерверСтоматология.ДобавитьБонусныеСчетаВОбновляемыеПоля(ПоляКарты.bonuses, ВладелецКарты, ИконкиУведомлений);
	ОбменДаннымиСерверСтоматология.ДобавитьЗадолженностьВОбновляемыеПоля(ПоляКарты.debt, ВладелецКарты);
		
	Если Не СменаВладельца Тогда
		ОбменДаннымиСерверСтоматология.ДобавитьСсылкуНаОнлайнЗаписьВОбновляемыеПоля(ПоляКарты.link);
	КонецЕсли;
		
КонецПРоцедуры

// Функция - Информировать по push wallet
// 
// Параметры:
//  Контрагент			 - 	 - 
//  ВнешняяСистемаWallet - 	 - 
//  Сообщение			 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ЕстьКартыWallet(Контрагент) Экспорт
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Карты.ВнутреннийКодКарты КАК ВнутреннийКодКарты
	|ИЗ
	|	Справочник.Карты КАК Карты
	|ГДЕ
	|	Карты.ВладелецКарты = &ВладелецКарты
	|	И НЕ Карты.ПометкаУдаления
	|	И НЕ Карты.Заблокирована
	|	И Карты.ТипКода = ЗНАЧЕНИЕ(Перечисление.ВидыКарт.Wallet)
	|	И Карты.ВнутреннийКодКарты <> """"");
	
	Запрос.УстановитьПараметр("ВладелецКарты", Контрагент);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

// Функция, обновляет карты контрагента.
// 
Функция ОбновитьКартыКонтрагента(Контрагент, ВнешняяСистемаWallet, ОписаниеОшибки) Экспорт
	
	РезультатОбновления = Истина;
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Карты.ВнутреннийКодКарты КАК ВнутреннийКодКарты
	|ИЗ
	|	Справочник.Карты КАК Карты
	|ГДЕ
	|	Карты.ВладелецКарты = &ВладелецКарты
	|	И НЕ Карты.ПометкаУдаления
	|	И НЕ Карты.Заблокирована
	|	И Карты.ТипКода = ЗНАЧЕНИЕ(Перечисление.ВидыКарт.Wallet)
	|	И Карты.ВнутреннийКодКарты <> """"");
	
	Запрос.УстановитьПараметр("ВладелецКарты", Контрагент);
	МассивВнутреннихКодов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВнутреннийКодКарты");
	
	Если ЗначениеЗаполнено(МассивВнутреннихКодов) Тогда
		
		// один на все карты
		ТелоЗапроса = ПолучитьТелоЗапроса(Контрагент,, МассивВнутреннихКодов);
		РезультатОбновления = ОбновитьМассивКарт(ТелоЗапроса, ВнешняяСистемаWallet, ОписаниеОшибки);		
		
	КонецЕсли;
	
	Возврат РезультатОбновления;
	
КонецФункции

// Функция, обновляет массив карт wallet.
// 
Функция ОбновитьМассивКарт(ТелоЗапроса, ВнешняяСистемаWallet, ОписаниеОшибки) Экспорт
	
	Попытка		
		
		Соединение = Новый HTTPСоединение(ПолучитьАдресAPI(ВнешняяСистемаWallet),,,,,, Новый ЗащищенноеСоединениеOpenSSL()); 
		Заголовки  = Новый Соответствие;    
		Заголовки.Вставить("X-Client-Id"    , ВнешняяСистемаWallet.ТокенДоступа);
		Заголовки.Вставить("X-Client-Secret", ВнешняяСистемаWallet.КлючШифрования);
		Заголовки.Вставить("Content-Type"   , "application/json");
		
		ЗапросНаОбновление = Новый HTTPЗапрос("/v1/passes/by-fields", Заголовки); 
		ЗапросНаОбновление.УстановитьТелоИзСтроки(ТелоЗапроса);
		
		Результат = Соединение.ВызватьHTTPМетод("PATCH", ЗапросНаОбновление);					
		
	Исключение	
		
		ОписаниеОшибки = "Wallet: " + ОписаниеОшибки();
		Возврат Истина; // чтобы при обновлении клиента не вываливалось в отказ, если сервис не доступен.
		
	КонецПопытки;
	
	ПараметрыJson = РазобратьJson(Результат, Истина);
	
	Если Результат.КодСостояния <> 200 Тогда	
		
		ОписаниеОшибки = "Wallet: " + ПараметрыJson["error"]["message"];	
		Возврат Ложь;
		
	Иначе
		
		Для Каждого РезультатОбновденияПоКарте Из ПараметрыJson["data"]	Цикл
			
			Если Не РезультатОбновденияПоКарте.Значение["success"] Тогда
				
				Если РезультатОбновденияПоКарте.Значение["error"]["code"] = "not_found" Тогда // карта не найдена, удаляем
					УдалитьЭлектроннуюКарту(РезультатОбновденияПоКарте.Ключ);			
					Продолжить;	
				КонецЕсли;
				
				ОписаниеОшибки = РезультатОбновденияПоКарте.Значение["error"]["message"];
				Возврат Ложь;	
				
			КонецЕсли;
			
		КонецЦикла;
		
		Возврат Истина;
		
	КонецЕсли;
	
КонецФункции

// Процедура, удаляет карту.
//
Процедура УдалитьЭлектроннуюКарту(ВнутреннийКодКарты)
	
	УдаляемаяКарта = Справочники.Карты.НайтиПоРеквизиту("ВнутреннийКодКарты", ВнутреннийКодКарты);
	
	Если ЗначениеЗаполнено(УдаляемаяКарта) Тогда
		
		КартаОбъект = УдаляемаяКарта.ПолучитьОбъект();	
		КартаОбъект.УстановитьПометкуУдаления(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

// Функция, возвращает нумераторы электронных карт.
// 
Функция ПолучитьНумераторыЭлектронныхКарт(ВнешняяСистемаWallet) Экспорт
	
	РезультатЗапроса = ПолучитьСтруктуруВозврата();
	
	Попытка		
		
		Соединение = Новый HTTPСоединение(ПолучитьАдресAPI(ВнешняяСистемаWallet),,,,,, Новый ЗащищенноеСоединениеOpenSSL()); 
		Заголовки  = Новый Соответствие;    
		Заголовки.Вставить("X-Client-Id"    , ВнешняяСистемаWallet.ТокенДоступа);
		Заголовки.Вставить("X-Client-Secret", ВнешняяСистемаWallet.КлючШифрования);
						
		httpЗапрос = Новый HTTPЗапрос("/v1/numerators", Заголовки); 
		Результат  = Соединение.Получить(httpЗапрос);					
		
	Исключение	
		
		РезультатЗапроса.ОписаниеОшибки = "Wallet: " + ОписаниеОшибки();	
		Возврат РезультатЗапроса;
		
	КонецПопытки;
	
	ПараметрыJson = РазобратьJson(Результат);
	
	Если Результат.КодСостояния = 200 Тогда
			
		РезультатЗапроса.Успешно = Истина;
		РезультатЗапроса.data	 = ПараметрыJson.data;
		
		Возврат РезультатЗапроса;
		
	Иначе
		
		РезультатЗапроса.ОписаниеОшибки = "Wallet: " + ПараметрыJson.error.message;
		Возврат РезультатЗапроса;
		
	КонецЕсли;		
	
КонецФункции

// Функция, создает нумератор.
// 
Функция СоздатьНумератор(ВнешняяСистемаWallet, Название, Префикс, СтартовыйНомер, Формат) Экспорт
	
	РезультатЗапроса = ПолучитьСтруктуруВозврата();
	
	Попытка		
		
		Соединение = Новый HTTPСоединение(ПолучитьАдресAPI(ВнешняяСистемаWallet),,,,,, Новый ЗащищенноеСоединениеOpenSSL()); 
		Заголовки  = Новый Соответствие;    
		Заголовки.Вставить("X-Client-Id"    , ВнешняяСистемаWallet.ТокенДоступа);
		Заголовки.Вставить("X-Client-Secret", ВнешняяСистемаWallet.КлючШифрования);
		Заголовки.Вставить("Content-Type"   , "application/json");
		
		httpЗапрос = Новый HTTPЗапрос("/v1/numerators", Заголовки); 
		httpЗапрос.УстановитьТелоИзСтроки(СобратьJson(Новый Структура("name, prefix, start, format", Название, Префикс, СтартовыйНомер, Формат)));
		Результат  = Соединение.ОтправитьДляОбработки(httpЗапрос);					
		
	Исключение	
		
		РезультатЗапроса.ОписаниеОшибки = "Wallet: " + ОписаниеОшибки();	
		Возврат РезультатЗапроса;
		
	КонецПопытки;
	
	Если Результат.КодСостояния = 201 Тогда
			
		РезультатЗапроса.Успешно = Истина;
		Возврат РезультатЗапроса;
		
	Иначе
		
		ПараметрыJson = РазобратьJson(Результат);
		
		РезультатЗапроса.ОписаниеОшибки = "Wallet: " + ПараметрыJson.error.message;
		Возврат РезультатЗапроса;
		
	КонецЕсли;		
	
КонецФункции

// Функция, возвращает сертификаты электронных карт.
// 
Функция ПолучитьСертификатыЭлектронныхКарт(ВнешняяСистемаWallet) Экспорт
	
	РезультатЗапроса = ПолучитьСтруктуруВозврата();
	
	Попытка		
		
		Соединение = Новый HTTPСоединение(ПолучитьАдресAPI(ВнешняяСистемаWallet),,,,,, Новый ЗащищенноеСоединениеOpenSSL());
		Заголовки  = Новый Соответствие;    
		Заголовки.Вставить("X-Client-Id"    , ВнешняяСистемаWallet.ТокенДоступа);
		Заголовки.Вставить("X-Client-Secret", ВнешняяСистемаWallet.КлючШифрования);
						
		httpЗапрос = Новый HTTPЗапрос("/v1/certificates", Заголовки); 
		Результат  = Соединение.Получить(httpЗапрос);					
		
	Исключение	
		
		РезультатЗапроса.ОписаниеОшибки = "Wallet: " + ОписаниеОшибки();	
		Возврат РезультатЗапроса;
		
	КонецПопытки;
	
	ПараметрыJson = РазобратьJson(Результат);
	
	Если Результат.КодСостояния = 200 Тогда
			
		РезультатЗапроса.Успешно = Истина;
		РезультатЗапроса.data	 = ПараметрыJson.data;
		
		Возврат РезультатЗапроса;
		
	Иначе
		
		РезультатЗапроса.ОписаниеОшибки = "Wallet: " + ПараметрыJson.error.message;
		Возврат РезультатЗапроса;
		
	КонецЕсли;		
	
КонецФункции

// Функция, возвращает карты по дополнительному владельцу.
//
Функция ПолучитьКартыПоДопВладельцу(ДопВладелец) Экспорт
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Карты.Ссылка КАК Карта
	|ИЗ
	|	Справочник.Карты КАК Карты
	|ГДЕ
	|	Карты.ДополнительныйВладелец = &ДопВладелец
	|	И НЕ Карты.ПометкаУдаления
	|	И НЕ Карты.Заблокирована
	|	И Карты.ТипКода = ЗНАЧЕНИЕ(Перечисление.ВидыКарт.Wallet)
	|	И Карты.ВнутреннийКодКарты <> """"");
	
	Запрос.УстановитьПараметр("ДопВладелец", ДопВладелец);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Карта");
	
КонецФункции

// Функция, возвращает адрес API webcitrus.
//
Функция ПолучитьАдресAPI(ВнешняяСистемаWallet)
	
	ПараметрыВнешнейСистемы = ВнешняяСистемаWallet.Параметры.Получить();
	
	Если ПараметрыВнешнейСистемы <> Неопределено И ПараметрыВнешнейСистемы.Свойство("АдресAPI") Тогда
		АдресAPI = ПараметрыВнешнейСистемы.АдресAPI;
	Иначе
		АдресAPI = "api.webcitrus.app";
	КонецЕсли;
	
	Возврат АдресAPI;
	
КонецФункции

// Функция возвращает массив актуальных дисконтных карт клиента.
//
Функция ПолучитьАктуальныеДисконтныеКартыКлиента(Клиент) Экспорт
	
	Если Не ЗначениеЗаполнено(Клиент) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Карты.Ссылка
	               |ИЗ
	               |	Справочник.Карты КАК Карты
	               |ГДЕ
	               |	НЕ Карты.ПометкаУдаления
	               |	И НЕ Карты.Заблокирована
	               |	И Карты.ВладелецКарты = &ВладелецКарты
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Карты.ДатаОткрытия УБЫВ";
				   
	Запрос.УстановитьПараметр("ВладелецКарты", Клиент);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Функция - Получить содержание текста выдачи карты
//
// Параметры:
//  КороткаяСсылка			 - 	 - 
//  ПараметрыВнешнейСистемы	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСодержаниеТекстаВыдачиКарты(КороткаяСсылка, ПараметрыВнешнейСистемы = Неопределено, СтруктурнаяЕдиница = Неопределено, ВнешняяСистемаWallet = Неопределено) Экспорт
	
	ШаблонСообщения = "";
	
	Если Не ЗначениеЗаполнено(ВнешняяСистемаWallet) И Не ЗначениеЗаполнено(ПараметрыВнешнейСистемы) Тогда
		ВнешняяСистемаWallet = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, Перечисления.ТипыВнешнихСистем.Wallet, Истина);					
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ВнешняяСистемаWallet) И Не ЗначениеЗаполнено(ПараметрыВнешнейСистемы) Тогда
		ПараметрыВнешнейСистемы = ВнешняяСистемаWallet.Параметры.Получить();
	КонецЕсли;
		
	Если ПараметрыВнешнейСистемы <> Неопределено И ЗначениеЗаполнено(СтруктурнаяЕдиница) И ТипЗнч(ПараметрыВнешнейСистемы) = Тип("Структура") 
		И ПараметрыВнешнейСистемы.Свойство("ШаблонСообщения") И ПараметрыВнешнейСистемы.Свойство("ШаблонСообщенияПеревод") Тогда
		
		Если ЗначениеЗаполнено(СтруктурнаяЕдиница.Язык) И НРег(СтруктурнаяЕдиница.Язык.СимвольныйКод) = "en" Тогда		
			ШаблонСообщения = ?(ЗначениеЗаполнено(ПараметрыВнешнейСистемы.ШаблонСообщенияПеревод), ПараметрыВнешнейСистемы.ШаблонСообщенияПеревод, ПараметрыВнешнейСистемы.ШаблонСообщения);			
		Иначе
			ШаблонСообщения = ПараметрыВнешнейСистемы.ШаблонСообщения;				
		КонецЕсли;
		
	Иначе		
		ШаблонСообщения = "Выпущена электронная карта: " + КороткаяСсылка;		
	КонецЕсли;
	
	Если СтрНайти(ШаблонСообщения, "{КороткаяСсылкаНаКарту}") <> 0 Тогда		
		ШаблонСообщения = СтрЗаменить(ШаблонСообщения, "{КороткаяСсылкаНаКарту}", КороткаяСсылка);
	КонецЕсли;
	Если СтрНайти(ШаблонСообщения, "{ShortLinkOnCard}") <> 0 Тогда		
		ШаблонСообщения = СтрЗаменить(ШаблонСообщения, "{ShortLinkOnCard}", КороткаяСсылка);
	КонецЕсли;
	
	Возврат ШаблонСообщения;
	 	
КонецФункции

#КонецОбласти
